#pragma once

/*====================================================================
	게임 내에서 쓰이는 모든 Enum을 모아놓은 헤더파일입니다.
	enum보다는 enum class만 사용하도록 권장하며, 뒤에 :int를 붙여주세요.
====================================================================*/

#define GRAVITY 0.68f			//중력
#define JUMPPOWER 17			//점프력
#define SPEED 5					//속도
#define FRAMEINTERVAL 0.08f		//프레임인터벌

/*====================================================================
	대화 종류입니다.
====================================================================*/
enum class DIALOGLIST : int
{
	EASY_START,
	BOSS_START,
	BOSS_END,
};
/*====================================================================
	렌더 종류입니다.
====================================================================*/
enum class RENDERTYPE : int
{
	RENDER,
	FRAME_RENDER,
	ANI_RENDER,
};

/*====================================================================
	스테이지 종류입니다.
====================================================================*/
enum class STAGETYPE : int
{
	EASY,
	NORMAL,
	HARD,
	BOSS
};

/*====================================================================
UI 종류입니다.
====================================================================*/
enum class UITYPE : int
{
	UI,
	BAR,
	INVENTORY,
	LOCATIONLOCK,
};

/*====================================================================
	영상 종류입니다.
====================================================================*/
enum class VIDEOTYPE : int
{
	GAME_INTRO,
	BOSS_INTRO
};

/*====================================================================
	오브젝트의 그룹 종류입니다.
====================================================================*/
enum class OBJECT_GROUP : int
{
	PLAYER,
	ENEMY,
	BOSS,
	OBJECT,
	ITEM,
	WEAPON,
};

/*====================================================================
	좌우 방향의 종류입니다.
====================================================================*/
enum class DIRECTION : int
{
	LEFT,
	RIGHT,
	NONE
};

enum class MOVE_DIRECTION : int
{
	LEFT,
	RIGHT,
	UP,
	DOWN
};

/*====================================================================
	에너미의 종류입니다.
====================================================================*/
enum class ENEMY_TYPE : int
{
	SCHOOLGIRL,
	SCHOOLBOY,
	CHEERLEADER,
	BOSS
};

/*====================================================================
	오브젝트의 종류입니다.
====================================================================*/
enum class OBJECT_TYPE : int
{
	DESK,
	TABLE,
	VENDINGMACHINE,
	LADDER,
	HARDPLATFORM,
	PILLAR_LEFT,
	PILLAR_RIGHT,
	PILLAR_BIG_LEFT,
	PILLAR_BIG_RIGHT,
	PILLAR_PARTICLE_1,
	PILLAR_PARTICLE_2,
	PILLAR_PARTICLE_3,
};

enum class OBJECT_DESTRUCTION : int
{
	INDESTRUCTIBLE,
	BEFOREDESTRUCTION,
	DESTRUCTION,
};

/*====================================================================
	스테이지 문 활성화 상태입니다
====================================================================*/

enum class DOOR_ACTIVITY : int
{
	NON_ACTIVE,
	ACTIVE,
};

/*====================================================================
	아이템 종류입니다.
====================================================================*/
enum class ITEM_TYPE : int
{
	MONEY,
	COIN,
	MEAT,
	APPLE,
	HEN,
	CHILI
};

/*====================================================================
	무기 종류입니다.
====================================================================*/
enum class WEAPON_TYPE : int
{
	NONE,
	BAT,
	BASEBALL
};
